<template>
  <div id="revenue"></div>
</template>

<script>
    export default {
        name: "AppRevenue",
        mounted() {
            this.Draw(1);
        },
        methods:{
            Draw(data){
                let chart = this.$echarts.init(document.getElementById('revenue'));
                let option = {

                    tooltip: {
                        trigger: 'axis'
                    },
                    legend: {
                        data:['第一食堂','第二食堂','第三食堂','第四食堂','第五食堂','教师食堂']
                    },
                    grid: {
                        left: '3%',
                        right: '4%',
                        bottom: '3%',
                        containLabel: true
                    },

                    //保存为图片
                   /* toolbox: {
                        feature: {
                            saveAsImage: {}
                        }
                    },*/
                    xAxis: {
                        type: 'category',
                        boundaryGap: false,
                        data: ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20','21','22','23','24','25','26','27','28','29','30']
                    },
                    yAxis: {
                        type: 'value'
                    },
                    series: [
                        {
                            name:'第一食堂',
                            type:'line',
                            //stack: '总量',
                            data:[120, 132, 101, 134, 90, 230, 210,152,152,145,145,164,175,189,194,196,200,205,207,209,120, 132, 101, 134, 90, 230, 210,152,152,145]
                        },
                        {
                            name:'第二食堂',
                            type:'line',
                           // stack: '总量',
                            data:[200, 210, 220, 230, 240, 250, 260,270,280,290,300,310,320,330,340,350,360,370,380,390,120, 132, 101, 134, 90, 230, 210,152,152,145]
                        },
                        {
                            name:'第三食堂',
                            type:'line',
                           // stack: '总量',
                            data:[2000, 2100, 220, 2300, 2400, 2500, 2600,2700,2800,2900,3000,3100,3200,3300,3400,3500,3600,3700,3800,3900,120, 132, 101, 134, 90, 230, 210,152,152,145]
                        },
                        {
                            name:'第四食堂',
                            type:'line',
                           // stack: '总量',
                            data:[400, 410, 420, 430, 440, 450, 460,470,480,490,500,510,520,530,540,550,560,570,580,590,120, 132, 101, 134, 90, 230, 210,152,152,145]
                        },
                        {
                            name:'第五食堂',
                            type:'line',
                           // stack: '总量',
                            data:[4000, 4100, 4200, 4300, 4400, 4500, 4600,4700,4800,4900,5000,5100,5200,5300,5400,5500,5600,5700,5800,5900,120, 132, 101, 134, 90, 230, 210,152,152,145]
                        },
                        {
                            name:'教师食堂',
                            type:'line',
                           // stack: '总量',
                            data:[600, 610, 620, 630, 640, 650, 660,670,680,690,700,710,720,730,740,750,760,770,780,790,120, 132, 101, 134, 90, 230, 210,152,152,145]
                        },

                    ]
                };

                chart.setOption(option);
            },
        }
    }
</script>

<style scoped>
  #revenue{
    position: absolute;
    top:0;
    right: 0;
    width: 20%;
    height: 60%;
    background-color: #1ac7ff;
  }
</style>
